import { lib, game, ui, get, ai, _status } from "noname";

const translates = {
    tia_tiya: "缇娅",
    tia_tiya_prefix: "tia",
    tia_qiangli: "枪礼",
    tia_qiangli_info: "锁定技。当你使用或打出【闪】/【杀】（以“荣光”使用的【杀】除外）后，将牌堆顶一张牌暗置于武将牌上作为“弹药”，上限6张。出牌阶段，你的实体手牌【杀】/【酒】效果改为你摸一张牌，且不记使用次数、不受次数限制。",
    tia_rongguang: "荣光",
    tia_rongguang_info: "当你需要使用【杀】时，可移去最底端一张“弹药”，视为使用一张【杀】。以此法使用的【杀】每次结算结束时，你可移去最底端一张“弹药”，使此【杀】对同一目标额外结算一次。若此次移除的弹药点数＞16-4X，则此次结算被抵消（X为此【杀】结算次数，首次X=1）。抵消仍算结算结束，可继续尝试。目标不变。若初始弹药为悼舞明置弹药，则该荣光【杀】整张视为火【杀】；后续额外结算不改变属性。",
    tia_daowu: "悼舞",
    tia_daowu_info: "当你成为伤害牌目标时，若其使用者手牌数不小于你，则你可使用黑色牌作为【闪】或【杀】响应。以此法转化的牌进入弃牌堆时，可改为明置于武将牌上作为“弹药”（受6上限）。此明置弹药被“荣光”初始击发时使该荣光【杀】视为火【杀】。",
};

export default translates;
