import { lib, game, ui, get, ai, _status } from "noname";

const translates = {
    tia5_tiya: "缇娅",
    tia5_tiya_prefix: "黑纱鸣礼",

    tia5_danyi: "弹仪",
    tia5_danyi_info: "对自己使用。你选择一项：暗装2次；或摸两张牌，然后弃置一张牌。若弹药超过上限，按先进先出排出最早弹药。此牌不是锦囊牌，不能被【无懈可击】响应。",
    tia5_ammo: "弹药",
    tia5_qiangli: "枪礼",
    tia5_qiangli_info: "<b>锁定技，</b>你的回合内，你的实体【杀】/【酒】视为【弹仪】。【弹仪】：<b>暗装</b>2次；或摸两张牌，然后弃置一张牌。<b>暗装</b>：将牌堆顶一张牌暗置于武将牌上作为<b>\"弹药\"</b>，<b>\"弹药\"</b>上限6张，超过上限时按先进先出排出最早弹药。",
    tia5_rongguang: "荣光",
    tia5_rongguang_info: "当你需要使用【杀】时，你可移去最底端的一张\"弹药\"，视为使用一张【杀】；以此法使用的【杀】结算结束时，你可移去最底端的一张\"弹药\"，使此【杀】额外结算一次。若此次移除的\"弹药\"点数大于16-4X，视为此结算被抵消（X为此【杀】结算次数）。若初始击发移除的弹药为悼舞明置弹药，则此【杀】视为火【杀】。",
    tia5_daowu: "悼舞",
    tia5_daowu_info: "当你成为伤害牌目标时，你的黑色手牌可以视为【杀】或者【闪】响应。每当你使用实体【杀】或【闪】响应伤害牌后，你可将此牌明置于武将牌上作为\"弹药\"，且此\"弹药\"击发而使用的【杀】改为【火杀】。",
};

export default translates;
