import { lib, game, ui, get, ai, _status } from "noname";

const translates = {
    tia2_tiya: "缇娅",
    tia2_tiya_prefix: "黑纱鸣礼",

    tia2_ammo: "弹药",
    tia2_qiangli: "枪礼",
    tia2_qiangli_info: "锁定技：当你使用或打出【杀】/【闪】（以“荣光”使用的【杀】除外）后，将牌堆顶一张牌暗置于武将牌上作为“弹药”，上限6张。出牌阶段，你的实体手牌【杀】/【酒】不受次数和距离限制，且效果改为你摸一张牌，不记使用次数。",
    tia2_rongguang: "荣光",
    tia2_rongguang_info: "当你需要使用【杀】时，你可移去最底端的一张“弹药”，视为使用一张【杀】；以此法使用的【杀】结算结束时，你可移去最底端的一张“弹药”，使此【杀】额外结算一次。若此次移除的“弹药”点数大于16-4X，视为此结算被抵消（X为此【杀】结算次数）。若初始击发移除的弹药为悼舞明置弹药，则此【杀】视为火【杀】。",
    tia2_daowu: "悼舞",
    tia2_daowu_info: "当你成为伤害牌目标时，你可使用黑色牌作为【闪】或【杀】响应。以此法转化的牌进入弃牌堆时，你可改为将其明置于武将牌上作为“弹药”。此“弹药”作为“荣光”初始击发的弹药时，此【杀】视为火【杀】。",
};

export default translates;
