import { lib, game, ui, get, ai, _status } from "noname";

const translates = {
    tia4_tiya: "缇娅",
    tia4_tiya_prefix: "黑纱鸣礼",

    tia4_danyi: "弹仪",
    tia4_danyi_info: "对自己使用。你选择一项：暗装2次；或摸两张牌，然后弃置此次摸到的一张牌。若弹药超过上限，按先进先出排出最早弹药。此牌不是锦囊牌，不能被【无懈可击】响应。",
    tia4_ammo: "弹药",
    tia4_qiangli: "枪礼",
    tia4_qiangli_info: "<b>锁定技，</b>你的实体【杀】/【酒】始终视为【弹仪】。【弹仪】：<b>暗装</b>2次；或摸两张牌，然后弃置此次摸到的一张牌。<b>暗装</b>：将牌堆顶一张牌暗置于武将牌上作为<b>“弹药”</b>，<b>“弹药”</b>上限6张，超过上限时按先进先出排出最早弹药。",
    tia4_rongguang: "荣光",
    tia4_rongguang_info: "当你需要使用【杀】时，你可移去最底端的一张“弹药”，视为使用一张【杀】；以此法使用的【杀】结算结束时，你可移去最底端的一张“弹药”，使此【杀】额外结算一次。若此次移除的“弹药”点数大于16-4X，视为此结算被抵消（X为此【杀】结算次数）。若初始击发移除的弹药为悼舞明置弹药，则此【杀】视为火【杀】。",
    tia4_daowu: "悼舞",
    tia4_daowu_info: "你的回合外，失去手牌时<b>暗装</b>，且你的黑色手牌可以视为【杀】或者【闪】。以此法转化的牌进入弃牌堆时可将其<b>明装</b>。<b>明装</b>：将此牌明置于武将牌上作为“弹药”且此“弹药”<b>击发</b>而使用的【杀】改为【火杀】。",
};

export default translates;
